<?php
/**
 * アイコン(管理画面関連)
 *
 * @package ystandard
 * @author  yosiakatsuki
 * @license GPL-3.0+
 */

namespace ystandard;

defined( 'ABSPATH' ) || die();

/**
 * Class Icons_Admin
 *
 * @package ystandard
 */
class Icons_Admin {


	/**
	 * メニュー用アイコン取得
	 *
	 * @return string
	 */
	public static function get_admin_menu_icon() {
		return 'data:image/svg+xml;base64,' . base64_encode( '<svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 40 40"><g id="ys-menu-icon" data-name="ys-menu-icon"><g><path d="M18.37,22.44v8.69a3.5,3.5,0,0,1-3.51,3.5H5.2V31.72h9.66a.58.58,0,0,0,.42-.18.57.57,0,0,0,.17-.41v-2.7H6a3.35,3.35,0,0,1-2.48-1,3.35,3.35,0,0,1-1-2.48V12.84H5.36V24.92a.62.62,0,0,0,.6.6h8.9a.58.58,0,0,0,.42-.18.61.61,0,0,0,.17-.42V12.84h2.92Z" fill="#e1e1e1"/><path d="M37,16.29v.59H34.09v-.59a.57.57,0,0,0-.17-.42.61.61,0,0,0-.42-.17H24.6a.61.61,0,0,0-.42.17.58.58,0,0,0-.18.42v2.27a.54.54,0,0,0,.18.41.58.58,0,0,0,.42.18h8.9A3.5,3.5,0,0,1,37,22.66v2.26a3.52,3.52,0,0,1-3.51,3.51H24.6a3.52,3.52,0,0,1-3.51-3.51v-.59H24v.59a.62.62,0,0,0,.6.6h8.9a.58.58,0,0,0,.42-.18.57.57,0,0,0,.17-.42V22.66a.57.57,0,0,0-.17-.42.58.58,0,0,0-.42-.18H24.6a3.5,3.5,0,0,1-3.51-3.5V16.29a3.35,3.35,0,0,1,1-2.48,3.39,3.39,0,0,1,2.48-1h8.9a3.39,3.39,0,0,1,2.48,1A3.35,3.35,0,0,1,37,16.29Z" fill="#e1e1e1"/></g></g></svg>' );
	}
}
